

void lowNum(int X[]) //────────────────── 오름차순 함수정의?
{
    int min;    //────────────────── 빈 공간변수 선언
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            if (X[i] < X[j])    //──────i번째가 j번째보다 낮다면
            {
                min = X[j];     //────빈그릇에 j번째 값 넣기
                X[j] = X[i];    //────j번째에 i번째 값 넣기
                X[i] = min;     //────i번째에 빈그릇에담긴 j값 넣기
            }
        }

    }

};

void highNum(int X[])//────────────────── 내름차순 함수정의?
{
    int min;    //────────────────── 빈 공간변수 선언
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            if (X[i] > X[j])    //──────i번째가 j번째보다 높다면
            {
                min = X[j];     //────빈그릇에 j번째 값 넣기
                X[j] = X[i];    //────j번째에 i번째 값 넣기
                X[i] = min;     //────i번째에 빈그릇에담긴 j값 넣기
            }
        }

    }

};