
// ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡014 #include ¹è¿ì±â ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡

#include "stdafx.h"		// 1 #include "ÆÄÀÏÀÌ¸§" = »ç¿ëÀÚ°¡ ¸¸µç ´Ù¸¥ ÆÄÀÏÀ» ÂüÁ¶ÇÒ¶§ »ç¿ë
#include <vector>		// 2 #include <ÆÄÀÏÀÌ¸§> = c++ ¿¡¼­ Á¦°øÇÏ´Â ±âº» ¶óÀÌºê·¯¸®¸¦ »ç¿ë
//						   
/*
int main() {
	vector<int> exam;
	exam.push_back(10);
	exam.push_back(20);
	exam.push_back(30);

	for (int i = 0, size = exam.size(); i < size; i++) {
		cout << "¹éÅÍ °ª : " << exam.at(i) << endl;
	}


	return 0;
}
*/
// ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡015 ½ºÄÚÇÎ·ê ÀÌÇØÇÏ±â ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡
/*
int x = 10;
int func1() 
{
	int y = x + 10;
	return y;
}
int func2() 
{
	int x = 100;
	return x;
}

int main() {

	cout << "y = " << func1() << endl;      // 20
	cout << "x = " << func2() << endl;		// 100
	cout << "x = " << x << endl;			// 10
	// °°Àº ÀÌ¸§ÀÇ º¯¼ö¶óµµ ¿µ¿ª¿¡ µû¶ó °ªÀÌ ´Þ¶óÁú ¼ö ÀÖ´Ù. º¯¼ö°¡ À¯È¿ÇÑ °ø°£ÀÌ Á¸ÀçÇÏ´Âµ¥ ÀÌ ¿µ¿ªÀ» scope¶ó°í ÇÑ´Ù.
	// Àü¿ªº¯¼ö x·Î »ç¿ëµÈ ³»¿ë Âü°í.

	return 0;
}
*/
// ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡018 Á¤¼öÇü º¯¼ö ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡
// int = Á¤¼ö 
// ÀÚ·áÇü ¹üÀ§ = -2,147,483,648 ~ +2,147,483,647
// unsigned int = 0 ~ 4,294,967,295
// ¾Æ½ºÅ°ÄÚµå A = 65
// º¯¼ö´Â char < short < int < long < long long ¼ø¼­·Î byte Å©±â°¡ Ä¿Áü
// ½Ç¼öÇü º¯¼ö Áß double = 8¹ÙÀÌÆ® (¼Ò¼öÁ¡ 15ÀÚ¸®)
// ½Ç¼öÇü º¯¼ö Áß float = 4¹ÙÀÌÆ® (¼Ò¼öÁ¡ 7ÀÚ¸®)

// ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡020 ³í¸®Çü º¯¼ö(bool) ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡
/*
int main() {
	int x = 10;
	int y = 6;

	bool is_true = false; // bool º¯¼ö ¼±¾ð folse´Â ÀÏ¹ÝÀû Á¶°Ç¿¡¼­ "¸Â´Ù"´Â °ÍÀ» À¯ÃßÇÏ±â À§ÇÔÀ¸·Î »ç¿ëµÇ¹Ç·Î ÃÊ¹Ý false·Î ¼±¾ð
	
	if (x > y) 
	{
		is_true = true;
	}
	else
	{
		is_true = false;
	}
	//true´Â Á¤¼ö 1, false´Â Á¤¼ö 0°ªÀ» °®°ÔµÈ´Ù.
	// À§¿¡´Â x¿Í yÀÇ Å©±â¸¦ ºñ±³

	if (is_true == true)
	{
		cout << "x´Â yº¸´Ù Å®´Ï´Ù" << endl;
	}
	else
	{
		cout << "x´Â yº¸´Ù ÀÛ½À´Ï´Ù" << endl;
	}
	// À§ÀÇ ºñ±³µÇ¾î ³ª¿Â °á°ú°ªÀ» ÅëÇØ ¶Ç´Ù½Ã ºñ±³ÇÏ¿© Ãâ·Â

	return 0;
}
*/

// ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡023 Áõ°¨¿¬»êÀÚ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡
/*
int main() {

	int x = 1;
	cout << "x = " << x++ << endl;			// 1     x=1À» ¸ÕÀú »ç¿ëÇÏ°í ±×´ÙÀ½¿¡ +1ÀÌ ºÙ±â ¶§¹®¿¡ ±×´ë·Î Ãâ·Â
	cout << "x = " << x++ << endl;			// 2     À§¿¡ ¸ÕÀú 1 ³ªÅ¸³Â°í ´õÇÑ°ª Ãâ·Â
	cout << "x = " << ++x << endl;			// 4     ++°¡ ¾Õ¿¡ ¿À°Ô µÈ´Ù¸é ¸ÕÀú 1À» Áõ°¡ÇÑ µÚ Ãâ·ÂµÊ
	cout << "x = " << x-- << endl;			// 4	 ÇöÀç °ª ³ªÅ¸³»°í ±×´ÙÀ½¿¡ -1 ºÙ±â ¶§¹®¿¡ ±×´ë·Î Ãâ·Â
	cout << "x = " << x-- << endl;			// 3	
	cout << "x = " << --x << endl;			// 1	 --°¡ ¾Õ¿¡ ¿À°Ô µÈ´Ù¸é ¸ÕÀú 1À» °¨¼ÒÇÑ µÚ Ãâ·Â
	
	return 0;
}
*/
// ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡029 Ä³½ºÆ® ¿¬»êÀÚ(static_cast)¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡
/*
int main() {

	int x = 2;									//Á¤¼öÇü º¯¼ö ¼±¾ð
	double y = 4.4;								//½Ç¼öÇü º¯¼ö ¼±¾ð

	int i = static_cast<int>(y / x);			// i¿¡ 4.4 / 2¸¦ ÀúÀåÇÏÁö¸¸ int(Á¤¼ö)¿¡ double(½Ç¼ö)¸¦ ÀúÀåÇÒ ¼ö ¾ø¾î¼­ °á°ú°¡ 2 ³ªÅ¸³². ÀÌ¶§ static_cast¸¦ ÅëÇØ int·Î Á¤½Ä º¯È¯ÇØ¾ßÇÔ
	int j = (int)y / x;							// C¾ð¾î ½ºÅ¸ÀÏ Ä³½ºÆÃÀÌ³ª °¡±ÞÀû c++¿¡¼­ »ç¿ëÇÏÁö ¸»°Í.
	double k = y / x;							// k´Â ¼Ò¼öÁ¡ ÀúÀåÀÌ °¡´ÉÇá¿© Ä³½ºÆÃ ÇÏÁö¾Ê°í °á°ú°ª ³ªÅ¸³¿

	cout << "4.4 / 2 = (static_cast<int>) " << i << endl;
	cout << "4.4 / 2 = (int) " << j << endl;
	cout << "4.4 / 2 = " << k << endl;

	// -------------Ä³½ºÆ® 4°¡Áö ¹æ¹ýÀº °£´ÜÈ÷ ¾Æ·¡¾Æ °°À½--------------
	// static_cast<> : °¡Àå ±âº»ÀûÀÎ Ä³½ºÆ® ¿¬»ê¹æ¹ý
	// dynamic_cast<> : °´Ã¼ÁöÇâ ¾ð¾îÀÇ ´ÙÇü¼ºÀ» ÀÌ¿ëÇÏ¿© ¸ðÈ£ÇÑ Å¸ÀÔ Ä³½ºÆÃ ¿À·ù¸¦ ¸·¾ÆÁÜ
	// const_cast<> : ÀÚ·áÇüÀÌ °®°íÀÖ´Â »ó¼ö ¼Ó¼ºÀ» Á¦°Å
	// reinterpret_cast<> : ¾î¶°ÇÑ Æ÷ÀÎÅÍ Å¸ÀÔ³¢¸®µµ º¯È¯ÇÒ ¼ö ÀÖ°Ô µµ¿ò

	return 0;
}
*/

// ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡036 ¼øÈ¯¹®À¸·Î È¦¼ö Â¦¼ö Ã£±â(for)¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡
/*
int main() { 
	
	int data[10] = { 5, 19, 76, 3, 10, 89, 54, 43, 2, 17 };

	for (int i = 0; i < 10; i++)
	{
		if (data[i] % 2 == 0)
			cout << i << " : " << data[i] << "´Â Â¦¼ö ÀÔ´Ï´Ù." << endl;
		else
			cout << i << " : " << data[i] << "´Â È¦¼ö ÀÔ´Ï´Ù." << endl;
	}
	// È¦¼ö¿Í Â¦¼ö Â÷ÀÌ¸¦ ±¸º°ÇØº»´Ù¸é 2·Î ³ª´©¾úÀ»¶§ ³ª¸ÓÁö °ªÀÌ ³²´ÂÁö or ³²Áö ¾Ê´ÂÁö ±¸º°ÇÏ¿© ºÐ¸®ÇÏµµ·Ï ±¸ÇØ³¾ ¼ö ÀÖ´Ù.

		
	return 0; 
}
*/
// ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡038 Á¶°Ç ¼øÈ¯¹® 1. while~ continue ~ break ¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡¦¡
int main() {
	int number = 0;
	// number¸¦ Áõ°¡½ÃÅ°±â À§ÇØ while¿¡ 10º¸´Ù ÀÛÀ»¶§ °è¼Ó ½ÃÇà½ÃÅ°µµ·Ï (¹«ÇÑ·çÇÁÀÓ)

	// ±× ¾È¿¡¼­ if¹®À» ÅëÇØ number°ªÀÌ 3ÀÇ ¹è¼ö¶ó¸é (%3 ³ª¸ÓÁö°ªÀÌ 0ÀÏ¶§ 3¹è¼ö ³Ñ¾î°¡µµ·Ï) Ãâ·ÂÀÌ ¼öÇàµÇÁö ¾Êµµ·Ï
	while (number < 10) {
		number++;
		if (number % 3 == 0)
			continue;
		else
			cout << "number °ª : " << number << endl;
	
	}
	
	return 0;
}